# Parameter Type Id Plane Show Param Property

Source: https://www.revitapidocs.com/2026/d3a8743c-fa9d-4bae-cd37-9a568e7c7aa8.htm

---

| Parameter Type Id Plane Show Param Property |
| --- |

"Show Host"
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static ForgeTypeId PlaneShowParam { get; }
```

```
Public Shared ReadOnly Property PlaneShowParam As ForgeTypeId
	Get
```

```
public:
static property ForgeTypeId^ PlaneShowParam {
	ForgeTypeId^ get ();
}
```

```
static member PlaneShowParam : ForgeTypeId with get
```

#### Property Value

ForgeTypeId See Also

#### Reference

ParameterTypeId Class Autodesk.Revit.DB Namespace